package com.sist;
/*
 *   2차원 배열 : 행+열 ==> 테이블
 *   int[][] arr=new int[5][5];
 *         0     1     2     3     4
 *   ====================================
 *  0      1     2     3     4     5
 *     [0][0] [0][1] [0][2] [0][3] [0][4]
 *   ====================================
 *  1      6     7     8     9    10
 *     [1][0] [1][1] [1][2] [1][3] [1][4]
 *   ====================================
 *  2     11    12    13    14    15
 *   ====================================
 *  3     16    17    18    19    20
 *   ====================================
 *  4     21    22    23    24    25
 *   ====================================
 */
public class MainClass1 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		int[][] arr=new int[5][5];
		int k=1;
		for(int i=0;i<5;i++) //row
		{
			for(int j=0;j<5;j++) //col
			{
				arr[i][j]=k;
				k++;
			}
		}
		//출력
		for(int i=0;i<5;i++)
		{
			for(int j=0;j<5;j++)
			{
				System.out.printf("arr[%d][%d]=%d\t",i,j,arr[i][j]);
			}
			System.out.println();
		}
	}

}
